<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"9d6a5517dc2d0d4673b74bc796122435efd9e2a9ab3f3f8e5b7c0e3c24a51c6f","plan_job_ref":"Job Terraform Plan #15 at https://github.com/YanSharp/aws-ecs-rds-terraform/actions/runs/17260265271","plan_out_hash":"161b7388991ce4f19711d50571aec1d0ddbcdbcc3c415b9e57a532e6f35f0136","plan_hash":"510a30a0afd4702331060f15beeb570decaa52f3554d13877bc559970ed21a19","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __terraform__
With backend config files: `backend.hcl`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_iam_role.example_role will be created
+   resource "aws_iam_role" "example_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "examplerole"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Env"     = "dev"
+           "Owner"   = "YanSharp-Terraform"
+           "Project" = "aws-ecs-rds-terraform"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #15](https://github.com/YanSharp/aws-ecs-rds-terraform/actions/runs/17260265271)